dvdogs/app/controllers/camps_controller.rb

SELECT * FROM "camps"
---
  def index
    @camps = Camp.all

SELECT * FROM "camps" WHERE ("camps"."id" = 980190962)
---
  def show
    @camp = Camp.find(params[:id])

INSERT INTO "camps" ("name", "rating", "location", "created_at", "updated_at", "description") VALUES(NULL, NULL, NULL, '2010-07-18 20:04:33', '2010-07-18 20:04:33', NULL)
---
  def create
    @camp = Camp.new(params[:camp])

    respond_to do |format|
      if @camp.save