dvdogs/app/controllers/dogs_controller.rb

SELECT * FROM "dogs"
SELECT * FROM "trips" INNER JOIN "dogs_trips" ON "trips".id = "dogs_trips".trip_id WHERE ("dogs_trips".dog_id = 1 )
---
  def index
    @dogs = Dog.all
    @dogs_active_hominid = Dog.active_hominid
    @dogs_inactive_hominid = Dog.inactive_hominid

    @dogs_active_canine = Dog.active_canine
    @dogs_inactive_canine = Dog.inactive_canine

    @dogs_current = []
    @dogs_old = []

    # ok, this may be wrong, but I want to filter for if this dog has been on at least
    # one of the last 3 trips.

    @dogs.each do |dog|
      if (Trip.last3 - dog.trips).size < 3 then

SELECT * FROM "dogs" WHERE ("dogs"."id" = 1)
---
  def show
    @dog = Dog.find(params[:id])

SELECT * FROM "dogs" WHERE ("dogs"."id" = 1)
---
  def edit
    @dog = Dog.find(params[:id])

INSERT INTO "dogs" ("name", "created_at", "photo_file_size", "profile", "known_for", "updated_at", "photo_file_name", "photo_content_type", "birth_date", "family", "ham", "active") VALUES(NULL, '2010-07-18 20:04:33', NULL, NULL, NULL, '2010-07-18 20:04:33', NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    @dog = Dog.new(params[:dog])

    respond_to do |format|
      if @dog.save

SELECT * FROM "dogs" WHERE ("dogs"."id" = 1)
UPDATE "dogs" SET "updated_at" = '2010-03-13 03:48:50', "birth_date" = '2005-08-10' WHERE "id" = 1
---
  def update

    params[:dog][:trip_ids] ||= []

    @dog = Dog.find(params[:id])

    respond_to do |format|
      if @dog.update_attributes(params[:dog])