dvdogs/app/controllers/hike_stories_controller.rb

  def index
    @hike_stories = HikeStory.all
---
SELECT * FROM "hike_stories"

  def show
    @hike_story = HikeStory.find(params[:id])
---
SELECT * FROM "hike_stories" WHERE ("hike_stories"."id" = 1)

  def edit
    @hike_story = HikeStory.find(params[:id])
---
SELECT * FROM "hike_stories" WHERE ("hike_stories"."id" = 4)

  def create
    @hike_story = HikeStory.new(params[:hike_story])

    respond_to do |format|
      if @hike_story.save
---
INSERT INTO "hike_stories" ("created_at", "photo_file_size", "updated_at", "short_description", "photo_file_name", "photo_content_type", "description", "dog_id", "hike_id") VALUES('2010-07-18 20:04:33', NULL, '2010-07-18 20:04:33', NULL, NULL, NULL, NULL, NULL, NULL)

  def update
    @hike_story = HikeStory.find(params[:id])

    respond_to do |format|
      if @hike_story.update_attributes(params[:hike_story])
---
SELECT * FROM "hike_stories" WHERE ("hike_stories"."id" = 8)
UPDATE "hike_stories" SET "updated_at" = '2010-05-14 16:39:13', "description" = 'We walked across and our feet got muddy. I had salt on my legs. Then we came to some water and things that were like, way too out there for me. So I turned around and took a picture that I liked and other people liked it too. We liked it.' WHERE "id" = 6

  def destroy
    @hike_story = HikeStory.find(params[:id])
    @hike_story.destroy
---
SELECT * FROM "hike_stories" WHERE ("hike_stories"."id" = 4)
DELETE FROM "hike_stories" WHERE "id" = 4