dvdogs/app/controllers/hike_events_controller.rb

SELECT * FROM "hike_events"
---
  def index
    @hike_events = HikeEvent.all

SELECT * FROM "hike_events" WHERE ("hike_events"."id" = 980190962)
---
  def show
    @hike_event = HikeEvent.find(params[:id])

INSERT INTO "hike_events" ("created_at", "updated_at", "description", "hike_id") VALUES('2010-07-18 20:04:33', '2010-07-18 20:04:33', NULL, NULL)
---
  def create
    @hike_event = HikeEvent.new(params[:hike_event])

    respond_to do |format|
      if @hike_event.save