dvdogs/app/controllers/hikes_controller.rb

SELECT * FROM "hikes" WHERE ("hikes"."id" = 1)
---
  def show
    @hike = Hike.find(params[:id])

SELECT * FROM "hikes" WHERE ("hikes"."id" = 1)
---
  def edit
    @hike = Hike.find(params[:id])

INSERT INTO "hikes" ("name", "created_at", "trip_id", "photo_file_size", "map_tracks", "updated_at", "photo_file_name", "photo_content_type", "date", "album", "map_points") VALUES(NULL, '2010-07-18 20:04:33', NULL, NULL, NULL, '2010-07-18 20:04:33', NULL, NULL, NULL, NULL, NULL)
---
  def create
    @hike = Hike.new(params[:hike])

    respond_to do |format|
      if @hike.save

SELECT * FROM "hikes" WHERE ("hikes"."id" = 1)
UPDATE "hikes" SET "updated_at" = '2010-05-03 23:06:47', "trip_id" = 1 WHERE "id" = 1
---
  def update
    @hike = Hike.find(params[:id])

    respond_to do |format|
      if @hike.update_attributes(params[:hike])