dvdogs/app/controllers/radios_controller.rb

SELECT * FROM "radios"
---
  def index
    @radios = Radio.all

SELECT * FROM "radios" WHERE ("radios"."id" = 980190962)
---
  def show
    @radio = Radio.find(params[:id])

INSERT INTO "radios" ("model", "created_at", "updated_at", "make", "description") VALUES(NULL, '2010-07-18 20:04:34', '2010-07-18 20:04:34', NULL, NULL)
---
  def create
    @radio = Radio.new(params[:radio])

    respond_to do |format|
      if @radio.save