dvdogs/app/controllers/rig_breakdowns_controller.rb

  def index
    @rig_breakdowns = RigBreakdown.all
---
SELECT * FROM "rig_breakdowns"

  def show
    @rig_breakdown = RigBreakdown.find(params[:id])
---
SELECT * FROM "rig_breakdowns" WHERE ("rig_breakdowns"."id" = 980190962)

  def create
    @rig_breakdown = RigBreakdown.new(params[:rig_breakdown])

    respond_to do |format|
      if @rig_breakdown.save
---
INSERT INTO "rig_breakdowns" ("rig_id", "location", "created_at", "updated_at", "description") VALUES(NULL, NULL, '2010-07-18 20:04:34', '2010-07-18 20:04:34', NULL)