dvdogs/app/controllers/rig_upgrades_controller.rb

SELECT * FROM "rig_upgrades"
---
  def index
    @rig_upgrades = RigUpgrade.all

SELECT * FROM "rig_upgrades" WHERE ("rig_upgrades"."id" = 980190962)
---
  def show
    @rig_upgrade = RigUpgrade.find(params[:id])

INSERT INTO "rig_upgrades" ("rig_id", "created_at", "updated_at", "description") VALUES(NULL, '2010-07-18 20:04:34', '2010-07-18 20:04:34', NULL)
---
  def create
    @rig_upgrade = RigUpgrade.new(params[:rig_upgrade])

    respond_to do |format|
      if @rig_upgrade.save