dvdogs/app/controllers/rigs_controller.rb

SELECT * FROM "rigs"
---
  def index
    @rigs = Rig.all

SELECT * FROM "rigs" WHERE ("rigs"."id" = 1)
---
  def show
    @rig = Rig.find(params[:id])

SELECT * FROM "rigs" WHERE ("rigs"."id" = 1)
---
  def edit
    @rig = Rig.find(params[:id])

INSERT INTO "rigs" ("model", "tires", "name", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "color", "engine", "year", "make", "dog_id", "picture", "active") VALUES(NULL, NULL, NULL, '2010-07-18 20:04:34', NULL, '2010-07-18 20:04:34', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    @rig = Rig.new(params[:rig])

    respond_to do |format|
      if @rig.save

SELECT * FROM "rigs" WHERE ("rigs"."id" = 1)
UPDATE "rigs" SET "updated_at" = '2010-05-04 18:27:48', "name" = 'The Iron Lung' WHERE "id" = 3
---
  def update
    @rig = Rig.find(params[:id])

    respond_to do |format|
      if @rig.update_attributes(params[:rig])