dvdogs/app/controllers/trips_controller.rb

  def show
    @trip = Trip.find(params[:id])
---
SELECT * FROM "trips" WHERE ("trips"."id" = 1)

  def edit
    @trip = Trip.find(params[:id])
---
SELECT * FROM "trips" WHERE ("trips"."id" = 1)

  def create
    @trip = Trip.new(params[:trip])

    respond_to do |format|
      if @trip.save
---
INSERT INTO "dogs_trips" ("trip_id", "dog_id") VALUES (4, 1)
INSERT INTO "rigs_trips" ("trip_id", "rig_id") VALUES (4, 1)
INSERT INTO "trips" ("name", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "date", "map_points") VALUES(NULL, '2010-07-18 20:04:34', NULL, '2010-07-18 20:04:34', NULL, NULL, NULL, NULL)

  def update
    @trip = Trip.find(params[:id])

    respond_to do |format|
      if @trip.update_attributes(params[:trip])
---
SELECT * FROM "trips" WHERE ("trips"."id" = 1)
UPDATE "trips" SET "date" = '1995-03-01', "updated_at" = '2010-04-23 19:23:49' WHERE "id" = 1