dvdogs/app/controllers/trip_stories_controller.rb

  def index
    @trip_stories = TripStory.all
---
SELECT * FROM "trip_stories"

  def show
    @trip_story = TripStory.find(params[:id])
---
SELECT * FROM "trip_stories" WHERE ("trip_stories"."id" = 980190962)

  def create
    @trip_story = TripStory.new(params[:trip_story])

    respond_to do |format|
      if @trip_story.save
---
INSERT INTO "trip_stories" ("trip_id", "photo_file_size", "created_at", "short_description", "photo_file_name", "updated_at", "photo_content_type", "description", "dog_id") VALUES(NULL, NULL, '2010-07-18 20:04:34', NULL, NULL, '2010-07-18 20:04:34', NULL, NULL, NULL)